// Задача на разбор числа на цифры и переворот
int a = 1234567;
int n = 0;
int q = 0;
int newN = 0; // для переворота числа наоборот
while (a > 0)
{
    q = a % 10;
    newN = newN * 10 + q; // для переворота числа наоборот
    a = a / 10;
    n++;
    System.Console.WriteLine($"{a,10} {q} {n}");
}